app/controllers/companies_controller.rb

  def index
    @companies = Company.find(:all, :conditions => ['name LIKE ?', "%#{params[:search]}%"])
---
SELECT * FROM "companies" WHERE (name LIKE '%%')

  def show
    @company = Company.find(params[:id])
    @contacts = CompanyContact.all
---
SELECT * FROM "companies" WHERE ("companies"."id" = 2)
SELECT * FROM "company_contacts"

  def edit
    @company = Company.find(params[:id])
---
SELECT * FROM "companies" WHERE ("companies"."id" = 1)

  def create
    @company = Company.new(params[:company])

    respond_to do |format|
      if @company.save
---
INSERT INTO "companies" ("name", "created_at", "updated_at") VALUES('google', '2010-03-04 17:49:05', '2010-03-04 17:49:05')

  def update
    @company = Company.find(params[:id])

    respond_to do |format|
      if @company.update_attributes(params[:company])
---
SELECT * FROM "companies" WHERE ("companies"."id" = 1)
UPDATE "companies" SET "updated_at" = '2010-03-04 17:52:46', "name" = 'howcasts' WHERE "id" = 1

  def destroy
    @company = Company.find(params[:id])
    @company.destroy
---
SELECT * FROM "companies" WHERE ("companies"."id" = 3)
DELETE FROM "companies" WHERE "id" = 3