app/controllers/company_contacts_controller.rb

  def index
    @company_contacts = CompanyContact.all
---
SELECT * FROM "company_contacts" WHERE (company_id LIKE '%%')

  def show
    @company_contact = CompanyContact.find(params[:id])
---
SELECT * FROM "company_contacts" WHERE ("company_contacts"."id" = 1)

  def edit
    @company_contact = CompanyContact.find(params[:id])
---
SELECT * FROM "company_contacts" WHERE ("company_contacts"."id" = 1)

  def create
    @company_contact = CompanyContact.new(params[:company_contact])
    @company_contact.company_id = (params[:company_id])


    respond_to do |format|
      if @company_contact.save
---
INSERT INTO "company_contacts" ("name", "created_at", "updated_at", "company_id", "email") VALUES('samir', '2010-03-04 19:33:49', '2010-03-04 19:33:49', NULL, '')

  def update
    @company_contact = CompanyContact.find(params[:id])

    respond_to do |format|
      if @company_contact.update_attributes(params[:company_contact])
---
SELECT * FROM "company_contacts" WHERE ("company_contacts"."id" = 1)
UPDATE "company_contacts" SET "updated_at" = '2010-03-04 19:25:32', "email" = '', "name" = 'company contact1' WHERE "id" = 1

  def destroy
    @company_contact = CompanyContact.find(params[:id])
    k = @company_contact.company_id
    @company_contact.destroy
---
SELECT * FROM "company_contacts" WHERE ("company_contacts"."id" = 6)
DELETE FROM "company_contacts" WHERE "id" = 6