app/controllers/engine_yard_contacts_controller.rb

SELECT * FROM "engine_yard_contacts"
---
  def index
    @engine_yard_contacts = EngineYardContact.all

SELECT * FROM "engine_yard_contacts" WHERE ("engine_yard_contacts"."id" = 37)
---
  def show
    @engine_yard_contact = EngineYardContact.find(params[:id])

SELECT * FROM "engine_yard_contacts" WHERE ("engine_yard_contacts"."id" = 2)
---
  def edit
    @engine_yard_contact = EngineYardContact.find(params[:id])

INSERT INTO "engine_yard_contacts" ("name", "created_at", "updated_at", "email") VALUES('ey 2', '2010-03-04 18:00:34', '2010-03-04 18:00:34', '')
---
  def create
    @engine_yard_contact = EngineYardContact.new(params[:engine_yard_contact])

    respond_to do |format|
      if @engine_yard_contact.save

SELECT * FROM "engine_yard_contacts" WHERE ("engine_yard_contacts"."id" = 2)
UPDATE "engine_yard_contacts" SET "updated_at" = '2010-03-04 18:02:31', "name" = 'ey 3' WHERE "id" = 2
---
  def update
    @engine_yard_contact = EngineYardContact.find(params[:id])

    respond_to do |format|
      if @engine_yard_contact.update_attributes(params[:engine_yard_contact])

SELECT * FROM "engine_yard_contacts" WHERE ("engine_yard_contacts"."id" = 3)
DELETE FROM "engine_yard_contacts" WHERE "id" = 3
---
  def destroy
    @engine_yard_contact = EngineYardContact.find(params[:id])
    @engine_yard_contact.destroy