app/controllers/statement_of_works_controller.rb

  def index
    @statement_of_works = StatementOfWork.all
---
SELECT * FROM "statement_of_works" ORDER BY created_at DESC

  def show
    @statement_of_work = StatementOfWork.find(params[:id])
---
SELECT * FROM "statement_of_works" WHERE ("statement_of_works"."id" = 1)

  def edit
    @statement_of_work = StatementOfWork.find(params[:id])
---
SELECT * FROM "statement_of_works" WHERE ("statement_of_works"."id" = 1)

  def create
    @statement_of_work = StatementOfWork.new(params[:statement_of_work])

    company = Company.find_or_create_by_name(params[:company][:name])
  	@statement_of_work.company = company

  	contact = CompanyContact.find_or_create_by_name(params[:company_contact][:name])
  	@statement_of_work.company_contact = contact

  	ey = EngineYardContact.find_or_create_by_name(params[:engine_yard_contact][:name])
---
SELECT * FROM "company_contacts" WHERE ("company_contacts"."name" = 'asdadasds') LIMIT 1
SELECT * FROM "engine_yard_contacts" WHERE ("engine_yard_contacts"."name" = 'sdjjsd') LIMIT 1

  def destroy
    @statement_of_work = StatementOfWork.find(params[:id])
---
SELECT * FROM "statement_of_works" WHERE ("statement_of_works"."id" = 1)