app/controllers/statement_of_works_controller.rb

SELECT * FROM "statement_of_works" WHERE ("statement_of_works"."slug" = '1269556909') LIMIT 1
---
  def show
    @statement_of_work = StatementOfWork.find_by_slug(params[:id])

SELECT * FROM "statement_of_works" WHERE ("statement_of_works"."slug" = '1269556909') LIMIT 1
SELECT * FROM "companies"
SELECT * FROM "company_contacts"
SELECT * FROM "engine_yard_contacts"
---
  def edit
    @statement_of_work = StatementOfWork.find_by_slug(params[:id])
    @company = Company.all
    @comp = Company.new
    @cont= 1
    @company_contacts = CompanyContact.all
    @engine_yard_contacts = EngineYardContact.all

INSERT INTO "companies" ("name", "created_at", "updated_at") VALUES(NULL, '2010-03-08 22:20:26', '2010-03-08 22:20:26')
SELECT * FROM "companies" WHERE ("companies"."name" = 'gono') LIMIT 1
SELECT "statement_of_works".id FROM "statement_of_works" WHERE ("statement_of_works"."id" IS NULL) LIMIT 1
SELECT * FROM "company_contacts" WHERE ("company_contacts"."id" IS NULL) LIMIT 1
INSERT INTO "engine_yard_contacts" ("name", "created_at", "updated_at", "id", "email") VALUES(NULL, '2010-03-25 22:41:32', '2010-03-25 22:41:32', NULL, NULL)
INSERT INTO "statement_of_works" ("slug", "scope", "created_at", "title", "add_terms", "updated_at", "est_fee", "engine_yard_contact_id", "no_hours", "company_id", "company_contact_id") VALUES('1269556892', '', '2010-03-25 22:41:32', 'foobar', '', '2010-03-25 22:41:32', NULL, 2, NULL, 2, NULL)
INSERT INTO "company_contacts" ("name", "created_at", "updated_at", "id", "company_id", "email") VALUES(NULL, '2010-03-16 19:05:11', '2010-03-16 19:05:11', NULL, NULL, NULL)
---
  def create
    @statement_of_work = StatementOfWork.new(params[:statement_of_work])

    company = Company.find_or_create_by_name(params[:company][:name])
  	@statement_of_work.company = company

  	contact = CompanyContact.find_by_id(params[:statement_of_work][:company_contact_id])
  	@statement_of_work.company_contact = contact

  	ey = EngineYardContact.find_or_create_by_id(params[:statement_of_work][:engine_yard_contact_id])
  	@statement_of_work.engine_yard_contact = ey

  	#@statement_of_work.id = Digest::MD5.digest("#{Time.now.utc} #{@statement_of_work.id}")

    respond_to do |format|
      if @statement_of_work.save

SELECT "statement_of_works".id FROM "statement_of_works" WHERE ("statement_of_works"."slug" = '1269556909' AND "statement_of_works".id <> 2) LIMIT 1
SELECT "statement_of_works".id FROM "statement_of_works" WHERE ("statement_of_works"."id" = 48928856354469 AND "statement_of_works".id <> 48928856354469) LIMIT 1
SELECT * FROM "companies" WHERE ("companies"."id" = 1)
SELECT * FROM "company_contacts" WHERE ("company_contacts"."id" = 1)
SELECT * FROM "engine_yard_contacts" WHERE ("engine_yard_contacts"."id" = 1)
UPDATE "statement_of_works" SET "updated_at" = '2010-03-15 17:20:11', "engine_yard_contact_id" = 4, "est_fee" = 234242.0, "company_contact_id" = 4, "no_hours" = 2342.0, "company_id" = 4 WHERE "id" = 32
---
  def update
    @statement_of_work = StatementOfWork.find_by_slug(params[:id])

    company = Company.find(params[:statement_of_work][:company_id])
  	@statement_of_work.company = company

  	contact = CompanyContact.find(params[:statement_of_work][:company_contact_id])
  	@statement_of_work.company_contact = contact

  	ey = EngineYardContact.find(params[:statement_of_work][:engine_yard_contact_id])
  	@statement_of_work.engine_yard_contact = ey

    respond_to do |format|
      if @statement_of_work.update_attributes(params[:statement_of_work])

SELECT * FROM "statement_of_works" WHERE ("statement_of_works"."slug" = 'Fri Mar 26 20:34:39 UTC 2010asdas') LIMIT 1
DELETE FROM "statement_of_works" WHERE "id" = 1
---
  def destroy
    @statement_of_work = StatementOfWork.find_by_slug(params[:id])
    @statement_of_work.destroy